/*  
What is the Big O notation for Function sortProductsByPrice of the Question 4. Explain your reason.
Answer: O(n²) เพราะ มีการใช้ for loop ซ้อนกัน การทำงานคือ ในรอบที่ 1 จะเอาข้อมูลของ price มาเปรียบเทียบกัน โดยเริ่มที่ index ที่ 0 กับ index ที่ 1 ถ้า index ที่ 0 มากว่าให้ สลับที่กับ index ที่ 1 เพื่อให้ให้ price ที่น้อยกว่าอยู่อันดับแรก ต่อมาก็ index ที่ 1 กับ 2 , 2 กับ 3 จบการทำงานรอบแรก รอบต่อมาจะเริ่มที่ index ที่ 1 กับ 2 , 2 กับ 3 จบการทำงานรอบสอง รอบต่อมาจะเริ่มที่ index ที่ 2 กับ 3 จบการทำงานรอบสาม การทำงานของ Bubble Sort จึงเป็นการทำงานที่เพิ่มขึ้นตามจำนวนข้อมูลที่ยกกำลัง2 เช่น ถ้ามีข้อมูล 4 ตัว ก็จะเป็น 4 กำลัง 2 เท่ากับ 16 รอบการทำงาน


*/
